In [1]:
import numpy as np;
import pandas as pd;

In [2]:
data ={
    "Name":["john","Anna","Peter","Linda"],
    "Age":[28,34,29,42],
    "City":["New York","Paris","Berlin","London"],
    "Salary":[65000, 70000 , 62000, 85000]
}

pd.DataFrame(data)

    Name  Age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
# using list
data_list =[
    ["john",28,"New York",65000],
    ["Anna",34,"Paris",70000],
    ["Peter",29,"Berlin",62000],
    ["Linda",42,"London",85000]
]
labels=["Name","age","City","Salary"]
df2 = pd.DataFrame(data_list, columns=labels)
print(df2)

    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
# Selection => use index
print(df2['Name'])
print(df2['age'])

0     john
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object
0    28
1    34
2    29
3    42
Name: age, dtype: int64

In [9]:
# selecting multiple columns
print(df2[['Name','City']])

    Name      City
0   john  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [11]:
# Create New Column
df2["Designation"] =["Doctor","Eng.","Doctor","Sailor"]
print(df2)

    Name  age      City  Salary Designation
0   john   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000      Sailor

In [13]:
#Remove Column
# axis 1 -> horizontally
# axis 0 -> vertical
df2.drop('Designation', axis=1)

    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [20]:
# for dropping use implace
df2

    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [19]:
# Permanent Deletion
#df2.drop('Designation', axis=1 , inplace=True)
print(df2)

    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [21]:
print(df2)

    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [24]:
# selecting row
print(df2.loc[0])
print(df2.loc[[0,1,2]])

Name          john
age             28
City      New York
Salary       65000
Name: 0, dtype: object
    Name  age      City  Salary
0   john   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000

In [28]:
# subset
df2.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [30]:
# HW
df2.loc[[2,3]][["Name","age"]]

    Name  age
2  Peter   29
3  Linda   42

In [32]:
#Conditional Selection
# > < = 
# age > 40
df2[df2["age"]>40]

    Name  age    City  Salary
3  Linda   42  London   85000

In [34]:
# age > 30 & location paris
df2[(df2["age"]>30) & (df2["City"] == "Paris")]

   Name  age   City  Salary
1  Anna   34  Paris   70000